let str = 'задача организации,   в особенности же консультация с широким активом играет важную роль в формировании 213 21  3123 213 54 654 654 65 67 86 97 990 0 0-9- 0=  8 6 8678 756 856 4756 456 354 356435 543 534 5 342 5342 5 342 243 423 543 53 45 345 существенных финансовых и административных условий. Товарищи! реализация намеченных плановых заданий позволяет оценить значение форм развития. Разнообразный и богатый опыт начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке систем массового участия. Повседневная практика показывает, что новая модель организационной деятельности играет важную роль в формировании системы обучения кадров, соответствует насущным потребностям. Значимость этих проблем настолько очевидна, что реализация намеченных плановых заданий играет важную роль в формировании дальнейших направлений развития. Не следует, однако забывать, что укрепление и развитие структуры способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же консультация с широким активом представляет собой интересный эксперимент проверки существенных финансовых и административных условий. Товарищи! дальнейшее развитие различных форм деятельности позволяет выполнять важные задания по разработке направлений прогрессивного развития. Значимость этих проблем настолько очевидна, что консультация с широким активом способствует подготовки и реализации существенных финансовых и административных условий. Задача организации, в особенности же дальнейшее развитие различных форм деятельности в значительной степени обуславливает создание модели развития. Разнообразный и богатый опыт реализация намеченных плановых заданий в значительной степени обуславливает создание направлений прогрессивного развития. Значимость этих проблем настолько очевидна, что постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки дальнейших направлений развития. Не следует, однако забывать, что новая модель организационной деятельности влечет за собой процесс внедрения и модернизации модели развития. Значимость этих проблем настолько очевидна, что постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки систем массового участия. Повседневная практика показывает, что рамки и место обучения кадров влечет за собой процесс внедрения и модернизации форм развития. Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании форм развития. Разнообразный и богатый опыт начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия.Разнообразный и богатый опыт дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. С другой стороны постоянный количественный рост и сфера нашей активности обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Не следует, однако забывать, что консультация с широким активом в значительной степени обуславливает создание новых предложений. Таким образом укрепление и развитие структуры позволяет оценить значение дальнейших направлений развития. Товарищи! сложившаяся структура организации влечет за собой процесс внедрения и модернизации направлений прогрессивного развития. Повседневная практика показывает, что новая модель организационной деятельности способствует подготовки и реализации новых предложений.';
//var str1 = 'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЬЫЪЭЮЯабвгдеёжзийклмнопрстуфхцчшщьыъэюя';
let counter = 0;
function col_word(str){
    let reg = /[а-яА-Я]+/g;
    return str.match(reg);
}

function col_chisl(str){
    let reg = /[0-9]+/g;
    return str.match(reg);
}

function split_symbol(str){
    let reg = /[а-яА-Я]/g;
    return str.match(reg);
}

 
function mapp(mapt){
    let map = new Map();
    for(let v of mapt){
        if(map.has(v)){
            map.set(v, map.get(v) + 1);
        }else{
            map.set(v, 1);
        }
    }
    console.log("-----");
    for(let empty of map){
        console.log(`${empty[0]} --- ${empty[1]}`)
    }
}

let mas_words = col_word(str);
for(let empty of mas_words){
    counter++
}
console.log(`Количество слов в тексте ${counter}`);

let mas_chisl = col_chisl(str);

let mas = [];
for(let empty of mas_chisl){
    mas.push(Number(empty));
}
mas.sort();
console.log(mas);
for(let empty of mas){
    console.log(empty);
}

mapt = split_symbol(str);
console.log(mapt);
mapp(mapt);

/*var regexp = /[А-Д]/gi;
var matches_array = str1.match(regexp);
console.log(str1.match(regexp));
console.log(matches_array);*/
// ['А', 'Б', 'В', 'Г', 'Д', 'а', 'б', 'в', 'г', 'д']

